Repository: alnqfihd7374/student_app1
Catalog: lib/l10n/app_*.arb
Languages: ar

# appTitle
source: Student's Ledger
ar: سجل طالب العلم

source: Start Now
ar: ابدأ الآن

source: First Name
ar: الاسم الأول

source: Last Name
ar: اللقب / العائلة

# kunya
source: Kunya (Abu ...)
ar: الكنية (أبو فلان)

# kunyaHint
source: Abu Abdullah
ar: أبو عبد الله

# validationRequired
source: This field is required
ar: هذا الحقل مطلوب

# welcome
source: Welcome {name}
ar: مرحباً بك يا {name}

source: Total Lessons
ar: مجموع الدروس

source: Attendance Rate
ar: نسبة الحضور

source: Consistency Streak
ar: أيام المواظبة

# searchHint
source: Search by Book or Teacher...
ar: ابحث باسم الكتاب أو الشيخ...

# filterAttended
source: Attended
ar: المحضور

# filterMissed
source: Missed
ar: الفائت

# addLesson
source: Add New Lesson
ar: إضافة درس جديد

# bookName
source: Book Title
ar: اسم المتن / الكتاب

source: Teacher Name
ar: اسم الشيخ

source: Date
ar: التاريخ

# status
source: Attendance Status
ar: حالة الحضور

# notes
source: Scientific Benefits & Notes
ar: الفوائد العلمية والشوارد

source: Save
ar: حفظ

source: Cancel
ar: إلغاء

source: Attended
ar: حضر

source: Missed
ar: غاب

source: Excused
ar: معذور

source: Postponed
ar: مؤجل

# noLessons
source: No lessons added yet. Start your journey!
ar: لم يتم إضافة أي دروس بعد. ابدأ بطلب العلم!

# deleteConfirm
source: Are you sure you want to delete this lesson?
ar: هل أنت متأكد من حذف هذا الدرس؟

source: Export Data
ar: تصدير البيانات

source: Import Data
ar: استيراد البيانات

source: Dark Mode
ar: الوضع الليلي

source: About App
ar: حول التطبيق

# aboutDescription
source: An app to help students of knowledge track their lessons and benefits.
ar: تطبيق يعين طالب العلم على ضبط فوائده ومتابعة دروسه وتقييم انتظامه في الطلب.
